# St7NewReinforcementLayout

Creates a new concrete reinforcement layout.

long St7NewReinforcementLayout(long uID, long LayoutID, char* LayoutName)

Input Parameters

uID

Strand7 model file ID.

Strand7 API Manual

LayoutID

Reinforcement layout ID.

LayoutName

Name of the layout.